#  Pandas DatetimeIndex

In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("C:\\Users\IT's MRK\Desktop\Learning\Pandas\Book4.csv")
df

         Date  Std ID  Class  Study hr  Percentage
0    1/1/2003  1001.0     10       2.0        50.0
1    1/2/2003  1002.0     10       NaN        60.0
2    1/3/2003     NaN     10       3.0        80.0
3    1/4/2003     NaN     11       0.0         NaN
4    1/5/2003  1005.0     11       4.0         NaN
5    1/6/2003     NaN     11      10.0        80.0
6    1/7/2003  1007.0     12       4.0        90.0
7    1/8/2003  1008.0     12       NaN        60.0
8    1/9/2003  1009.0     12       NaN        85.0
9   1/10/2003  1010.0     12       NaN         NaN
10  1/11/2003  1011.0     12       6.0        50.0

In [9]:
df.dtypes

Date           object
Std ID        float64
Class           int64
Study hr      float64
Percentage    float64
dtype: object

In [10]:
type(df.Date[0])

str

In [12]:
df = pd.read_csv("C:\\Users\IT's MRK\Desktop\Learning\Pandas\Book4.csv",parse_dates= ['Date'])
df

         Date  Std ID  Class  Study hr  Percentage
0  2003-01-01  1001.0     10       2.0        50.0
1  2003-01-02  1002.0     10       NaN        60.0
2  2003-01-03     NaN     10       3.0        80.0
3  2003-01-04     NaN     11       0.0         NaN
4  2003-01-05  1005.0     11       4.0         NaN
5  2003-01-06     NaN     11      10.0        80.0
6  2003-01-07  1007.0     12       4.0        90.0
7  2003-01-08  1008.0     12       NaN        60.0
8  2003-01-09  1009.0     12       NaN        85.0
9  2003-01-10  1010.0     12       NaN         NaN
10 2003-01-11  1011.0     12       6.0        50.0

In [13]:
df.dtypes

Date          datetime64[ns]
Std ID               float64
Class                  int64
Study hr             float64
Percentage           float64
dtype: object

In [14]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp